app/views/shared/_sidenav.html.erb

                      <span class="glyphicon glyphicon-chevron-right"></span> <%= course.name %>
                      <span class="label label-info pull-right"><%= course.users.length %></span>
---
SELECT "users".* FROM "users" WHERE ( name LIKE '%计%' and teacher=true)