app/controllers/courses_controller.rb

  def edit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def update
    @course = Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def open
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def close
    @course=Course.find_by_id(params[:id])
    @course.update_attributes(open: false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2018-01-14 11:27:58.725342"], ["id", 2]]

  def destroy
    @course=Course.find_by_id(params[:id])
    current_user.teaching_courses.delete(@course)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 2]]

   def studentlist
    @course=Course.find_by_id(params[:id])
    @grade=Grade.where(:course_id => params[:id]).paginate(page: params[:page], per_page: 8)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "grades".* FROM "grades" WHERE "grades"."course_id" = $1 LIMIT 8 OFFSET 0  [["course_id", 2]]

  def list
    #-------QiaoCode--------
    puts "7777777777777777777777777"
    @courses = Course.where(:open=>true).paginate(page: params[:page], per_page: 8)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."open" = $1 LIMIT 8 OFFSET 0  [["open", "t"]]
SELECT COUNT(*) FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]

  def select        #xzh
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

    tmp = 0
    tmp = @course.student_num
    tmp += 1
    @course.update_attributes(student_num: tmp)
---
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", 1], ["updated_at", "2018-01-14 11:27:58.824339"], ["id", 2]]

  def quit    #xzh
    @course=Course.find_by_id(params[:id])
    current_user.courses.delete(@course)
    tmp = 0
    tmp = @course.student_num
    tmp -= 1
    @course.update_attributes(student_num: tmp)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", -1], ["updated_at", "2018-01-14 11:27:58.836337"], ["id", 2]]

  def totalcredit    #xzh
    @course=current_user.courses
    tmp = []
    @course.each do |course|
---
SELECT "courses".* FROM "courses"

  def coursedetails
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]