app/controllers/evaluations_controller.rb

	def edit
	  @course=Course.find_by_id(params[:id])

    #nskk5
    @itemscount=Evaluationitem.count
    @itemsid=Array.new(@itemscount,0)
    @itemscontent=Array.new(@itemscount,"评价项")

    evaluationitems=Evaluationitem.all
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "evaluationitems"
SELECT "evaluationitems".* FROM "evaluationitems"

    end

    for k in 0..@itemscount-1
       @itemscontent[k]=Evaluationitem.find_by_id(@itemsid[k]).itemcontent
---
SELECT  "evaluationitems".* FROM "evaluationitems" WHERE "evaluationitems"."id" = $1 LIMIT 1  [["id", 2]]

	def insert
    @course=Course.find_by_id(params[:id])

    count=Evaluationitem.count
    ids=Array.new(count,0)

    evaluationitems=Evaluationitem.all
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 55]]
SELECT COUNT(*) FROM "evaluationitems"
SELECT "evaluationitems".* FROM "evaluationitems"

  def index
    @selectcontent=params[:selectcontent]
    if @selectcontent.nil? || @selectcontent.empty?
      @courses = Course.all.order("id ASC").paginate(page: params[:page], per_page: 8)
    else
      selectedusers=User.where(" name LIKE '%#{@selectcontent}%' and teacher=true").all
      selectedusersids= Array.new
      selectedusers.each do |s|
        selectedusersids << s.id
      end
      puts selectedusersids.length

      if selectedusersids.length==0
         @courses = Course.where(" name LIKE '%#{@selectcontent}%' or course_code LIKE '%#{@selectcontent}%' ").all.paginate(page: params[:page], per_page: 4)
---
SELECT  "courses".* FROM "courses"  ORDER BY id ASC LIMIT 8 OFFSET 0
SELECT "users".* FROM "users" WHERE ( name LIKE '%计%' and teacher=true)
SELECT  "courses".* FROM "courses" WHERE ( name LIKE '%计%' or course_code LIKE '%计%' ) LIMIT 4 OFFSET 0

  def items
    @evaluationitems=Evaluationitem.all.order("id ASC");
---
SELECT "evaluationitems".* FROM "evaluationitems"  ORDER BY id ASC

  def itemupdate
    if params[:evaluationitem][:itemcontent].nil? or params[:evaluationitem][:itemcontent]=="" or params[:evaluationitem][:itemcontent].lstrip==""
      redirect_to items_evaluations_path, flash: {:danger => "评估项不能为空!"}
    else
      @Evaluationitem=Evaluationitem.find_by_id(params[:id])
      @Evaluationitem.update_attributes(:itemcontent=>params[:evaluationitem][:itemcontent])
---
SELECT  "evaluationitems".* FROM "evaluationitems" WHERE "evaluationitems"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "evaluationitems" SET "itemcontent" = $1, "updated_at" = $2 WHERE "evaluationitems"."id" = $3  [["itemcontent", "无调课、停课、替讲现象"], ["updated_at", "2018-01-13 13:54:05.298736"], ["id", 2]]

  def itemdelete
    @Evaluationitem=Evaluationitem.find_by_id(params[:id])
    evaluations_foritem=Evaluation.where(:evaluationitem_id=>@Evaluationitem.id).all
    evaluations_foritem.each do |e|
       e.destroy
    end

    @Evaluationitem.destroy
---
SELECT  "evaluationitems".* FROM "evaluationitems" WHERE "evaluationitems"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."evaluationitem_id" = $1  [["evaluationitem_id", 2]]
DELETE FROM "evaluationitems" WHERE "evaluationitems"."id" = $1  [["id", 2]]

  def itemadd
    if params[:itemcontent].nil? or params[:itemcontent]=="" or params[:itemcontent].lstrip==""
      redirect_to items_evaluations_path, flash: {:danger => "评估项不能为空!"}
    else
      addevaluationitem=Evaluationitem.new
      addevaluationitem.itemcontent= params[:itemcontent]
      addevaluationitem.save
---
INSERT INTO "evaluationitems" ("itemcontent", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["itemcontent", "item1"], ["created_at", "2018-01-13 15:04:00.234621"], ["updated_at", "2018-01-13 15:04:00.234621"]]

  def result
    @course=Course.find_by_id(params[:id])

    #nskk6
    @itemscount=Evaluationitem.count
    @itemsid=Array.new(@itemscount,0)
    @itemscontent=Array.new(@itemscount,"评价项")

    evaluationitems=Evaluationitem.all
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "evaluationitems"
SELECT "evaluationitems".* FROM "evaluationitems"

    end

    for k in 0..@itemscount-1
       @itemscontent[k]=Evaluationitem.find_by_id(@itemsid[k]).itemcontent
---
SELECT  "evaluationitems".* FROM "evaluationitems" WHERE "evaluationitems"."id" = $1 LIMIT 1  [["id", 2]]